Tekla Open API Reference for Tekla Structures 2025
AnalysisBar.Add Method (AnalysisPosition, AnalysisMember)
 Adds a position and member to the analysis bar.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Add(
	AnalysisPosition position,
	AnalysisMember member
)
Public Sub Add (
	position As AnalysisPosition,
	member As AnalysisMember
)
Parameters
position
Type: Tekla.Structures.Analysis.AnalysisPosition
The position to be added.
member
Type: Tekla.Structures.Analysis.AnalysisMember
The member to be added.
See Also
Reference
AnalysisBar Class
Add Overload
Tekla.Structures.Analysis Namespace